/* `welcomeLabel` UILabel text default value */
"Welcome" = "Croeso";

/* `thankyouLabel` UILabel text default value */
"ThankyouMessage" = "Diolch am lwytho i lawr";

/* `instructionTextView` UITextView text default value with \".notConfigurated\" state */
"WelcomeInstruction" = "Dilynwch y cyfarwyddiadau a gewch yn y neges groeso dros e-bost er mwyn dechrau'r broses ysgogi.";

/* `instructionTextView` UITextView text default value with \".isConfigured\" state */
"ConfiguredInstruction" = "Daliwch ati i reoli eich tasgau dyddiol a chydweithio'n rhwydd ar brosiectau.";

"ScanInstruction" = "Sganiwch y cod QR diogel i ddechrau'r broses ysgogi.";

"DiscoveryServiceInstruction" = "Rhowch eich cyfeiriad e-bost er mwyn dechrau'r broses ysgogi.";

/* checking the account(email address) user entered in discovery service */
"CheckingAccountKey" = "Wrthi'n gwirio'r cyfrif...";

/* `signInButton` UIButton's titleLabel?.text default value */
"SignIn" = "Dechrau";

"Scan" = "Sganio";

/* `demoLabel` UILabel text default value */
"Explore" = "Ydych chi am fynd ati i archwilio?";

/* `demoButton` UIButton's titleLabel?.text default value */
"TryDemo" = "Rhowch gynnig ar y demo";

/* The title for the passcode setup screens. */
"SetPasscodeKey" = "Creu Cod Cyfrin";

/* The title for the enter passcode screen. */
"PasscodeKey" = "Cod cyfrin";

/* The title for the Choose Passcode screen. */
"ChoosePasscodeTitleKey" = "Dewis Cod Cyfrin";

/* The title for the Confirm Passcode screen. */
"ConfirmPasscodeTitleKey" = "Cadarnhau Cod Cyfrin";

/* The message on the confirm passcode screen for passcode setup. */
"EnterPasscodeAgainKey" = "Rhowch eich cod cyfrin eto.";

/* The message on the confirm passcode screen for passcode change. */
"ConfirmPasscodeKey" = "Cadarnhewch eich cod cyfrin.";

/* The message on the input passcode screen. */
"EnterYourPasscodeKey" = "Rhowch eich cod cyfrin.";

/* The title for the passcode change screens. */
"ChangePasscodeKey" = "Newid Cod Cyfrin";

/* The message on the input passcode screen in change passcode. */
"EnterYourCurrentPasscodeKey" = "Rhowch eich cod cyfrin presennol.";

/* The button title string used both in passcode and\n touch ID screens to indicate not to setup now. */
"NotNowKey" = "Dim nawr";

/* The button title string used on the second passcode setup\n to go back to the first screen. */
"BackKey" = "Yn ôl";

/* The button title string used on the first passcode setup\n to go to the next screen. */
"NextKey" = "Nesaf";

/* The button title string used on the passcode input screen (not in the change passcode sequence)\n When the passcode input screen is in the change passcode sequence, the button title should be changed \"Next\" */
"DoneKey" = "Wedi gwneud";

/* The main message format on the setup passscode screen.\n The %d will display the number of characters required from\n the passcode policy. */
"PasscodeChooseMinCharKey" = "Dewiswch god cyfrin sydd ag o leiaf %d nod er mwyn datgloi'r ap.";

/* The main message format on the setup passscode screen when the\n isDititsOnly property of the passcode policy is true.\n The %d will display the number of digits required from\n the passcode policy. */
"PasscodeChooseMinDigitKey" = "Dewiswch god cyfrin sydd ag o leiaf %d digid er mwyn datgloi'r ap.";

/* The message for passcode to include the required character groups\n when passcode policy requires it. */
"PasscodeRequiredGroupKey" = "Rhowch y canlynol:";

/* The group name for lower case letters. */
"LowerCaseKey" = "Llythyren fach (a-z)";

/* The group name for upper case letters. */
"UpperCaseKey" = "Llythyren fawr (A-Z)";

/* The group name for digits. */
"DigitsKey" = "Digidau (0-9)";

/* The group name for non-alphabetic characters. */
"Non-alphaKey" = "Symbolau (!@#...)";

/* The button title for resetting passcode. */
"ResetPasscodeKey" = "Ailosod Cod Cyfrin";

/* Alert message when validate method of FUIPasscodeValidationDelegate\n returning false for the passcode user entered in setup passcode. */
"PasscodeValidationFailedKey" = "Proses dilysu cod cyfrin wedi methu.";

/* Alert message when the passcode user entered was rejected by\n the FUIPasscodeControllerDelegate's shouldTryPasscode function. */
"PasscodeRejectedKey" = "Cafodd y cod cyfrin ei wrthod gan DirprwyReolyddCodCyfrinFUI.";

/* The alert button title used on passcode validation failed, or passcode rejected. */
"RetryKey" = "Ailgynnig";

/* The title for setup touch ID screen. */
"TouchIDKey" = "ID Cyffwrdd";

/* The title for setup touch ID screen. */
"FaceIDKey" = "ID Wyneb";

/* This is to be used combined with \"Touch ID\" or \"Face ID\", e.g., \"Touch ID is now available!\" */
"IsNowAvailableKey" = " ar gael nawr!";

/* The first paragraph of the message on the Touch ID screen when no Touch ID is enrolled on device. */
"TouchIDMessage1Key" = "Bydd galluogi ID Cyffwrdd yn rhoi mynediad cyflymach i chi at eich gwybodaeth.";

/* The second paragraph of the message on the Touch ID screen when no Touch ID is enrolled on device. */
"TouchIDMessage2Key" = "Gallwch droi'r nodwedd hon ymlaen neu ei diffodd unrhyw bryd yn Gosodiadau.";

/* The first paragraph of the message on the Touch ID screen when Touch ID is enrolled on device. */
"TouchIDEnableMessage1Key" = "Ewch ati i alluogi ID Cyffwrdd er mwyn cael mynediad cyflym a diogel.";

/* The second paragraph of the message on the Touch ID screen when Touch ID is enrolled on device. */
"TouchIDEnableMessage2Key" = "Os bydd ID Cyffwrdd wedi'i analluogi, gofynnir i chi am god cyfrin eich dyfais.";

/* The first paragraph of the message on the Face ID screen when no Touch ID is enrolled on device. */
"FaceIDMessage1Key" = "Bydd galluogi ID Wyneb yn rhoi mynediad cyflymach i chi at eich gwybodaeth.";

/* The second paragraph of the message on the Face ID screen when no Touch ID is enrolled on device. */
"FaceIDMessage2Key" = "Gallwch droi'r nodwedd hon ymlaen neu ei diffodd unrhyw bryd yn Gosodiadau.";

/* The first paragraph of the message on the Face ID screen when Touch ID is enrolled on device. */
"FaceIDEnableMessage1Key" = "Ewch ati i alluogi ID Wyneb er mwyn cael mynediad cyflym a diogel.";

/* The second paragraph of the message on the Face ID screen when Touch ID is enrolled on device. */
"FaceIDEnableMessage2Key" = "Os bydd ID Wyneb wedi'i analluogi, gofynnir i chi am god cyfrin eich dyfais.";

/* The alert title to ask user add fingerprints to use Touch ID. */
"UseTouchIDTitleKey" = "I ddefnyddio ID Cyffwrdd, ychwanegwch olion bysedd yng ngosodiadau eich dyfais.";

/* The alert message to ask user add fingerprints to use Touch ID. */
"UseTouchIDMessageKey" = "Gallwch wneud hyn unrhyw bryd o dan Gosodiadau - ID Cyffwrdd a Chod Cyfrin.";

/* The alert title to ask user add fingerprints to use Face ID. */
"UseFaceIDTitleKey" = "I ddefnyddio ID Wyneb, rhowch ID Wyneb ar waith yng ngosodiadau eich dyfais.";

/* The alert message to ask user add fingerprints to use Face ID. */
"UseFaceIDMessageKey" = "Gallwch wneud hyn unrhyw bryd o dan Gosodiadau - ID Wyneb a Chod Cyfrin.";

/* The message for the link on the Touch ID screen. */
"LearnMoreKey" = "Dysgu mwy am ID Cyffwrdd";

/* The message for the link on the Face ID screen. */
"LearnMoreFaceIDKey" = "Dysgu mwy am ID Wyneb";

/* The button title to enable Touch ID authentication. */
"EnableKey" = "Galluogi";

/* The message displayed when authticate with Touch ID. */
"AuthWithTouchIDKey" = "Dilysu gydag ID Cyffwrdd";

/* The message displayed when authticate with Face ID. */
"AuthWithFaceIDKey" = "Dilysu gydag ID Wyneb";

/* The title on the navigation bar. */
"TouchIDErrorNavigationTitleKey" = "Gwall";

/* The error title. */
"AuthenticationErrorKey" = "Gwall Dilysu";

/* The error message for Touch ID devices. */
"AuthenticationTouchIDMessageKey" = "Ewch ati i ddilysu gan ddefnyddio ID Cyffwrdd i ddefnyddio'r ap.";

/* The error message for Face ID devices. */
"AuthenticationFaceIDMessageKey" = "Ewch ati i ddilysu gan ddefnyddio ID Wyneb i ddefnyddio'r ap.";

/* The authenticate button text. */
"AuthenticateKey" = "Dilysu";

/* The message when the passcode entered in confirm passcode screen\n does not match with the one entered in the setup passcode screen. */
"PasscodeNotMatchKey" = "Doedd codau cyfrin ddim yn cyfateb. Rhowch gynnig arall arni.";

/* The message format to be displayed when user entered wrong passcode\n and the remaining number of retries is greater than 1. */
"AttemptsLeftKey" = "Mae gennych %d ymgais ar ôl.";

/* The message format to be displayed when user entered wrong passcode\n and there is only one remaining retry. */
"OneAttemptLeftKey" = "Mae gennych 1 ymgais ar ôl.";

/* The first paragraph of the alert message when the number user entered\n wrong passcode reached maximum allowed. */
"MaxAttemptsReachedKey" = "Does gennych ddim ymgais ar ôl.";

/* The second paragraph of the alert message when the number user entered\n wrong passcode reached maximum allowed. */
"EnterCredentialsKey" = "Mewngofnodwch i ailosod y cod cyfrin.";

/* The text of the dismiss button on the alert. */
"OKKey" = "Iawn";

/* The message on the passcode screen when user entered wrong passcode\n and there is no limit on the number of retries. */
"RetryPasscodeKey" = "Cod cyfrin anghywir. Rhowch gynnig arall arni.";

/* The scan page title string. */
"ScanKey" = "Sganio";

/* The title of the pop-up message when user selected a QR code photo\n which did not have a valid QR code. */
"ScanUnsuccessfulKey" = "Sganio Heb Lwyddo";

/* The second line of the pop-up message when user selected a QR code photo\n which did not have a valid QR code. */
"SelectAnotherImageKey" = "Dewiswch ddelwedd cod QR.";

/* The title of the pop-up message when user successfully got a QR code for\n onboarding activation but this QR code was not recognized by system. */
"InvalidQRCodeKey" = "Cod QR Annilys";

/* The second line of the pop-up message when user successfully got a QR code for\n onboarding activation but this QR code was not recognized by system. */
"QRCodeNotRecognizedKey" = "Heb adnabod y cod QR.";

/* The title of the alert to request photo access. */
"AllowPhotoAccessKey" = "Caniatáu Mynediad at Luniau";

/* The message of the alert to request photo access. */
"GiveAccessToPhotoSettingsKey" = "I ddewis delwedd cod QR, rhowch fynediad at eich lluniau yng ngosodiadau preifatrwydd eich dyfais.";

/* The title of the alert to request camera access. */
"AllowCameraAccessKey" = "Caniatáu Mynediad at Gamera";

/* The message of the alert to request camera access. */
"GiveAccessToCameraSettingsKey" = "I sgamio gyda'r camera, rhowch fynediad at eich camera yng ngosodiadau preifatrwydd eich dyfais.";

/* *\n The alert action title to go to Settings app. */
"SettingsKey" = "Gosodiadau";

/* The title string for the QR code scan confirmation screen. */
"ConfirmationKey" = "Cadarnhad";

/* The success message for the QR code scan confirmation screen. */
"ScanSucceededKey" = "Sganio wedi llwyddo. Byddwch yn cael eich cysylltu â:";

/* The title string for the \"Continue\" button */
"ContinueKey" = "Bwrw ymlaen";

/* The title string for the back bar button on activation screen */
"BackBarButtonForActivationScreenKey" = "Lansio";

/* FUIActivation Screen - headlineLabel */
"FUIActivationScreen_headlineLabel" = "Ysgogi";

/* FUIActivation Screen - detailLabel */
"FUIActivationScreen_detailLabel" = "Os cawsoch neges groeso dros e-bost, dilynwch y ddolen ysgogi yn y neges. Fel arall, rhowch eich cyfeiriad e-bost neu sganiwch y cod QR i ddechrau'r broses cynefino.";

/* FUIActivation Screen - primaryActionButton Title */
"FUIActivationScreen_primaryActionButtonTitle" = "Nesaf";

/* FUIActivation Screen - subheadlineLabel */
"FUIActivationScreen_subheadlineLabel" = "Neu";

/* FUIActivation Screen - primaryActionButton Title */
"FUIActivationScreen_secondaryActionButtonTitle" = "Sganio";

/* FUIEULAView Screen - agree button */
"AgreeKey" = "Cytuno";

/* FUIEULAView Screen - disagree button */
"DisagreeKey" = "Anghytuno";

/* The authentication title. */
"AuthenticationKey" = "Dilysu";

/* The basic authentication message. */
"basicAuthenticationMessageKey" = "Rhowch eich enw defnyddiwr a'ch cyfrinair er mwyn dilysu.";

/* Username input field placeholder string */
"usernameKey" = "enw defnyddiwr";

/* Password input field placeholder string */
"passwordKey" = "cyfrinair";

/* Sign In button string. */
"SignInKey" = "Mewngofnodi";

/* Error message when failed to sign in. */
"SignInErrorKey" = "Manylion adnabod anghywir. Rhowch gynnig arall arni.";

/* The dynamic authentication message. */
"DynamicAuthenticationMessageKey" = "Rhowch y wybodaeth isod er mwyn dechrau'r broses ysgogi.";

/* The message displayed on the banner when verifying information user entered. */
"VerifyingMessageKey" = "Wrthi'n gwirio'r wybodaeth...";

/* Cancel button string. */
"CancelKey" = "Canslo";

/* Allow button string. */
"AllowKey" = "Caniatáu";

/* Deny button string. */
"DenyKey" = "Gwrthod";

/* No button string. */
"NoKey" = "Na";

/* Quit button string. */
"QuitKey" = "Gadael";

/* GiveConsent button string. */
"GiveConsentKey" = "Rhoi caniatâd";

/* Navbar title string. */
"StepKey" = "Cam";

/* Navbar title string. */
"OfKey" = "o";

/* CancelConfirmation message string. */
"CancelConfirmationKey" = "Ydych chi'n siŵr eich bod am adael y broses cynefino?";

/* MandatoryMessage button string. */
"MandatoryMessageKey" = "Heb ganiatâd, fydd dim modd i chi fwrw ymlaen â'r broses cynefino.";

/* Switch User button string. */
"SwitchOrAddUserKey" = "Newid neu Ychwanegu Defnyddiwr";

/* Title for Log In button */
"LogInKey" = "Mewngofnodi";

/* Placeholder text in search bar for searching users in multi-user login controller */
"SearchUsersKey" = "Chwilio am ddefnyddwyr ar y ddyfais hon";

/* The button title for forgot passcode. */
"ForgotPasscodeKey" = "Wedi anghofio'r cod cyfrin?";

/* Title for Loction */
"PNLoctionTitleKey" = "Rhoi gwasanaethau lleoliad ymlaen er mwyn i chi allu defnyddio nodweddion map a llywio";

/* Title for Notifications */
"PNNotificationsTitleKey" = "Rhoi hysbysiadau ymlaen er mwyn i chi gael gwybod am gyhoeddiadau pwysig";

/* Title for Photos */
"PNPhotosTitleKey" = "Rhowch fynediad at y llyfrgell luniau ymlaen er mwyn i chi allu galluogi rhannu lluniau a chael mynediad at y llyfrgell luniau.";

/* Title for Calendar */
"PNCalendarTitleKey" = "Rhowch fynediad at y calendr ymlaen er mwyn i chi allu cadw ystafelloedd a gweld eich cyfarfodydd.";

/* Title for Camera */
"PNCameraTitleKey" = "Rhowch y camera ymlaen er mwyn i chi allu mewngofnodi a gwirio gan ddefnyddio Face ID.";

/* Subtitle for FUIPrivacyNoticeView */
"PNSubtitleKey" = "Gallwch chi newid yr hawl hwn yn ddiweddarach gan ddefnyddio gosodiadau’r ap.";

/* FooterText for FUIPrivacyNoticeSettingsController */
"PNSettingsFooterTextKey" = "Mae’r rhaglen yn defnyddio’r hawliau isod i roi’r profiad gorau gallwn ni i chi";

/* FooterText of Location for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsLocationFooterTextKey" = "Gadael i’r rhaglen gael mynediad at eich Lleoliad a rhoi gwybod i chi pan rydych chi’n ei ddefnyddio.\n\nI osod neu olygu eich hawl Lleoliad, agorwch eich gosodiadau iOS > Tapiwch “Lleoliad” > Tapiwch “Rhaglen” > Dewiswch y gosodiad hawl Lleoliad sydd orau gennych.";

/* FooterText of Notifications for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsNotificationsFooterTextKey" = "Gadael i’r rhaglen gael mynediad at eich Hysbysiadau a rhoi gwybod i chi pan rydych chi’n ei ddefnyddio.\n\nI osod neu olygu eich hawl Hysbysiadau, agorwch eich gosodiadau iOS > Tapiwch “Hysbysiadau” > Tapiwch “Rhaglen” > Dewiswch y gosodiad hawl Hysbysiadau sydd orau gennych.";

/* FooterText of Photos for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsPhotosFooterTextKey" = "Gadael i’r rhaglen gael mynediad at eich Lluniau a rhoi gwybod i chi pan rydych chi’n ei ddefnyddio.\n\nI osod neu olygu eich hawl Lluniau, agorwch eich gosodiadau iOS > Tapiwch “Lluniau” > Tapiwch “Rhaglen” > Dewiswch y gosodiad hawl Lluniau sydd orau gennych.";

/* FooterText of Camera for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsCameraFooterTextKey" = "Gadael i’r rhaglen gael mynediad at eich Camera a rhoi gwybod i chi pan rydych chi’n ei ddefnyddio.\n\nI osod neu olygu eich hawl Camera, agorwch eich gosodiadau iOS > Tapiwch “Camera” > Tapiwch “Rhaglen” > Dewiswch y gosodiad hawl Camera sydd orau gennych.";

/* FooterText of Calendar for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsCalendarFooterTextKey" = "Gadael i’r rhaglen gael mynediad at eich Calendr a rhoi gwybod i chi pan rydych chi’n ei ddefnyddio.\n\nI osod neu olygu eich hawl Calendr, agorwch eich gosodiadau iOS > Tapiwch “Calendr” > Tapiwch “Rhaglen” > Dewiswch y gosodiad hawl Calendr sydd orau gennych.";

/* The button title for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingKey" = "Agor Gosodiadau iOS";

